export const data = [
  {
    title: "목적",
    description:
      "엔딩크레딧은 이용자의 개인정보를 중요하게 여기며, 개인정보보호법 및 관련 법령을 준수합니다. 본 방침은 회사가 수집하는 개인정보의 항목, 이용목적, 보관 및 처리 방침을 안내합니다.",
  },

  {
    title: "수집하는 개인정보 항목",
    description:
      "1. 회원가입 시 수집 항목\n\tㆍ필수: 이름, 이메일, 비밀번호, 연락처\n\tㆍ선택: 생년월일, 주소\n2. 서비스 이용 시 수집 항목\n\tㆍ유언 대용 신탁 설계 정보, 연금 운용 관련 정보, 상속계획 자료\n\tㆍ접속 로그, 쿠키, IP 주소 등 서비스 이용기록",
  },
  {
    title: "개인정보의 수집 및 이용목적",
    description:
      "1. 회원 관리: 본인 확인, 회원 서비스 이용 안내\n2. 서비스 제공: 유언 설계, 상속계획 지원 및 연금 운용 상담\n3. 법적 의무 준수: 관련 법령에 따른 기록 보존",
  },
  {
    title: "개인정보 보유 및 이용기간",
    description:
      "1. 회원 탈퇴 시 개인정보는 즉시 삭제됩니다.\n2. 단, 관계 법령에 따라 보존이 필요한 경우, 다음과 같이 보관합니다.\n\tㆍ계약 및 청약철회 기록: 5년\n\tㆍ소비자 불만 처리 기록: 3년",
  },
  {
    title: "개인정보의 제3자 제공",
    description:
      "회사는 원칙적으로 이용자의 개인정보를 제3자에게 제공하지 않습니다. 단, 다음의 경우에는 예외로 합니다.\n1. 이용자가 사전에 동의한 경우\n2. 법령에 따라 제공 의무가 있는 경우",
  },
  {
    title: "이용자의 권리 및 행사 방법",
    description:
      "1. 이용자는 언제든지 자신의 개인정보를 조회하거나 수정할 수 있습니다.\n2. 개인정보 삭제를 요청할 경우, 회사는 지체 없이 이를 처리합니다.",
  },
  {
    title: "개인정보 보호를 위한 기술적/관리적 대책",
    description:
      "1. 개인정보는 암호화된 채널을 통해 저장 및 전송됩니다.\n2. 해킹 및 보안 침해 방지를 위해 정기적인 보안 점검을 시행합니다.",
  },
  {
    title: "문의처",
    description:
      "개인정보 보호와 관련한 문의는 아래로 연락해 주십시오.\n\tㆍ담당부서: 개인정보관리팀 임수진\n\tㆍ이메일: sujin0659@gmail.com\n\tㆍ연락처: 010-9920-4794",
  },
];
